# PANDAS == PANel DAta Structures
- module like numpy
- import pandas as pd
- base is numpy
- Series(1D) , DataFrame(2D)( sql table like)

In [1]:
import pandas as pd
import numpy as np

## Series = much like dictionary -- stores (key:value) pairs

In [2]:
d={'john':90,'tom':80,'julia':85,'robert':79} # python dictionary

In [3]:
d

{'john': 90, 'tom': 80, 'julia': 85, 'robert': 79}

In [4]:
s=pd.Series( [90,80,85,79] , index=['john','tom','julia','robert'])

In [5]:
type(s)

pandas.core.series.Series

In [6]:
s

john      90
tom       80
julia     85
robert    79
dtype: int64

In [7]:
s['john']

90

In [8]:
s['john'] = 91

In [9]:
s

john      91
tom       80
julia     85
robert    79
dtype: int64

In [10]:
s1=pd.Series( [90,80,85,79] ) # its not mandatory to pass index(keys) , values are mandatory

In [11]:
s1

0    90
1    80
2    85
3    79
dtype: int64

In [12]:
s1[0]

90

In [13]:
s1[0]=91

In [14]:
s1

0    91
1    80
2    85
3    79
dtype: int64

In [15]:
s1=pd.Series( np.array([90,80,85,79]) ) # np array can also be used

In [16]:
s1

0    90
1    80
2    85
3    79
dtype: int32

In [17]:
d={'virat':90,'shreyas':80,'rohit':85,'risav':79} # python dictionary

In [18]:
s1=pd.Series(d) # series created from a dictionary

In [19]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [20]:
for v in d:
    print(v)

virat
shreyas
rohit
risav

In [21]:
d

{'virat': 90, 'shreyas': 80, 'rohit': 85, 'risav': 79}

In [22]:
# for retrieves values from Series --> difference from dictionary
for v in s1:
    print(v)

90
80
85
79

In [23]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [24]:
s1.dtype

dtype('int64')

In [25]:
s1.ndim

1

In [26]:
s1.shape

(4,)

In [27]:
len(s1)

4

In [28]:
# converting a series into numpy array
arr=s1.values

In [29]:
np.quantile(arr,q=.25)

79.75

In [30]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [31]:
# getting indexes as numpy array
s1.index.values

array(['virat', 'shreyas', 'rohit', 'risav'], dtype=object)

In [32]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [33]:
s1['virat'] #cenventional

90

In [34]:
s1.get('virat')

90

In [35]:
# s1['bumrah'] error as no index

In [36]:
print(s1.get('bumrah')) # None == null

None

In [37]:
var=input('Enter a name ')
if (s1.get(var) != None):
    print(s1[var])
else:
    print('not exists')

Enter a name bumrah
not exists

In [38]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [39]:
s1['virat']

90

In [40]:
s1[0]

90

In [41]:
s1[0:2] # slicing

virat      90
shreyas    80
dtype: int64

In [42]:
s1[-1]

79

In [43]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [44]:
# converting a series bck to dictionary
d1=s1.to_dict()

In [45]:
d1

{'virat': 90, 'shreyas': 80, 'rohit': 85, 'risav': 79}

In [46]:
s1=s1.reindex(  ['rohit','virat','risav','shreyas']       ) # altering positions of index

In [47]:
s1

rohit      85
virat      90
risav      79
shreyas    80
dtype: int64

In [48]:
s1=s1.reindex(['rohit','virat','risav'])

In [49]:
s1

rohit    85
virat    90
risav    79
dtype: int64

In [50]:
del s1['risav']

In [51]:
s1

rohit    85
virat    90
dtype: int64

In [52]:
s1=pd.Series(d1)

In [53]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [54]:
s1=s1.reindex(['rohit','virat','risav','shreyas','sikhar'])

In [55]:
s1

rohit      85.0
virat      90.0
risav      79.0
shreyas    80.0
sikhar      NaN
dtype: float64

In [56]:
s1=pd.Series(d1)

In [57]:
s1

virat      90
shreyas    80
rohit      85
risav      79
dtype: int64

In [58]:
s1=s1.reindex(  ['rohit','virat','risav','shreyas','sikhar']       )

In [59]:
s1

rohit      85.0
virat      90.0
risav      79.0
shreyas    80.0
sikhar      NaN
dtype: float64

In [60]:
s1["vihari"]=77 # just like dictionary

In [61]:
s1

rohit      85.0
virat      90.0
risav      79.0
shreyas    80.0
sikhar      NaN
vihari     77.0
dtype: float64

In [62]:
l1=['rohit','virat','risav','shreyas','sikhar']

math=pd.Series([90,80,np.NaN,60,np.nan],index=l1)

In [63]:
math

rohit      90.0
virat      80.0
risav       NaN
shreyas    60.0
sikhar      NaN
dtype: float64

## data set MUST NOT have missing values 
- drop  all missing values  or
- replace missing values by some numeric value( what value is bestfor replacing ??? )

In [64]:
math.isna() # used to find if any MVs are there

rohit      False
virat      False
risav       True
shreyas    False
sikhar      True
dtype: bool

In [65]:
math.isna().sum()  # calculating total count of missing values [REMEMBER]

2

In [66]:
math.shape[0]

5

In [67]:
len(math)

5

In [68]:
math.isna().sum()/len(math) # very important to find amount missing values in the data

0.4

In [69]:
math.shape[0]

5

In [70]:
s2=pd.Series([90,80,85,79,80,85,84])

In [71]:
s2.isna().sum()/len(s2) # very important to find amount missing values in the data

0.0

In [72]:
s2

0    90
1    80
2    85
3    79
4    80
5    85
6    84
dtype: int64

In [73]:
s2.sum()

583

In [74]:
print('max:',s2.max())
print('min:',s2.min())
print('mean:',s2.mean())
print('var:',s2.var())
print('max:',s2.std())

max: 90
min: 79
mean: 83.28571428571429
var: 15.23809523809524
max: 3.9036002917941333

In [75]:
s2+10 # same vectorization as numpy

0    100
1     90
2     95
3     89
4     90
5     95
6     94
dtype: int64

In [76]:
s2

0    90
1    80
2    85
3    79
4    80
5    85
6    84
dtype: int64

In [77]:
s2 > 80

0     True
1    False
2     True
3    False
4    False
5     True
6     True
dtype: bool

In [78]:
s2[(s2 >=80) & (s2 <=85)]

1    80
2    85
4    80
5    85
6    84
dtype: int64

In [79]:
math

rohit      90.0
virat      80.0
risav       NaN
shreyas    60.0
sikhar      NaN
dtype: float64

In [80]:
math.isna()

rohit      False
virat      False
risav       True
shreyas    False
sikhar      True
dtype: bool

In [81]:
math[math.isna()]

risav    NaN
sikhar   NaN
dtype: float64

In [82]:
math[~math.isna()]

rohit      90.0
virat      80.0
shreyas    60.0
dtype: float64

In [83]:
math1=math[~math.isna()]

In [84]:
math1

rohit      90.0
virat      80.0
shreyas    60.0
dtype: float64

In [85]:
math

rohit      90.0
virat      80.0
risav       NaN
shreyas    60.0
sikhar      NaN
dtype: float64

In [86]:
math1=math.dropna() # createsa a new by removing all missing values

In [87]:
math1

rohit      90.0
virat      80.0
shreyas    60.0
dtype: float64

In [88]:
math

rohit      90.0
virat      80.0
risav       NaN
shreyas    60.0
sikhar      NaN
dtype: float64

In [89]:
math1=math.fillna(value=0) # creates a ne w series by replacing MV s with specified value

In [90]:
math1

rohit      90.0
virat      80.0
risav       0.0
shreyas    60.0
sikhar      0.0
dtype: float64

In [91]:
avg=math.mean()

In [92]:
avg

76.66666666666667

In [93]:
math1=math.fillna(value=avg)

In [94]:
math1

rohit      90.000000
virat      80.000000
risav      76.666667
shreyas    60.000000
sikhar     76.666667
dtype: float64

In [95]:
math1.astype(np.int)

rohit      90
virat      80
risav      76
shreyas    60
sikhar     76
dtype: int32

In [96]:
math.median()

80.0

In [97]:
math.mean()

76.66666666666667

In [98]:
math.quantile(q=.5)

80.0

In [99]:
s2

0    90
1    80
2    85
3    79
4    80
5    85
6    84
dtype: int64

In [100]:
s3=s2.astype(np.float)

In [101]:
s3.dtype

dtype('float64')

In [102]:
s3.astype(np.int)

0    90
1    80
2    85
3    79
4    80
5    85
6    84
dtype: int32

In [103]:
ser=pd.Series(['it','bca','cse','it','cse','bca','bca','it'])

In [104]:
ser.shape

(8,)

In [105]:
ser.unique().shape

(3,)

In [106]:
pd.unique(ser)

array(['it', 'bca', 'cse'], dtype=object)

In [107]:
ser.value_counts()

bca    3
it     3
cse    2
dtype: int64

In [108]:
ser=pd.Series( np.random.randint(low=10,high=71,size=1000) )

In [109]:
ser.describe()

count    1000.000000
mean       40.711000
std        17.676933
min        10.000000
25%        26.000000
50%        41.000000
75%        57.000000
max        70.000000
dtype: float64

In [110]:
??ser.describe

In [111]:
ser.describe(percentiles=[.1,.2,.3,.4,.5,.6,.7,.8,.9])

count    1000.000000
mean       40.711000
std        17.676933
min        10.000000
10%        16.000000
20%        22.000000
30%        29.000000
40%        35.000000
50%        41.000000
60%        46.400000
70%        53.000000
80%        59.000000
90%        64.100000
max        70.000000
dtype: float64

## DataFrame

In [112]:
l1=['rohit','virat','risav','shreyas','sikhar']
math=pd.Series([90,80,np.NaN,60,np.nan],index=l1)
phy=pd.Series([70,np.NaN,88,60,np.nan],index=l1)
chem=pd.Series([np.NaN,80,np.NaN,60,80],index=l1)
spn=pd.Series(['s','ns','s','ns','s'],index=l1)

In [113]:
## all above series have same index
## creating dictionary of serieses

In [114]:
d={'math':math,'physics':phy,'chemistry':chem,'sponsored':spn}

In [115]:
df=pd.DataFrame(d) # creating a data frame using dict of series

In [116]:
type(df)

pandas.core.frame.DataFrame

In [117]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    80.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

## DataFrame has 2 indexes : row index , column index
## DataFrame is horizontal association of few serieses sharing same index

In [118]:
arr=np.random.randint(low=10,high=51,size=(5,3))

In [119]:
arr

array([[44, 47, 16],
       [39, 39, 47],
       [18, 13, 29],
       [18, 36, 41],
       [38, 38, 31]])

In [120]:
df=pd.DataFrame(arr,index=['a','b','c','d','e'],columns=['col1','col2','col3'])

In [121]:
df

   col1  col2  col3
a    44    47    16
b    39    39    47
c    18    13    29
d    18    36    41
e    38    38    31

In [122]:
df=pd.DataFrame(arr,columns=['col1','col2','col3'])

In [123]:
df

   col1  col2  col3
0    44    47    16
1    39    39    47
2    18    13    29
3    18    36    41
4    38    38    31

In [124]:
df=pd.DataFrame(arr)

In [125]:
df

    0   1   2
0  44  47  16
1  39  39  47
2  18  13  29
3  18  36  41
4  38  38  31

In [126]:
df=pd.DataFrame(d)

In [127]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    80.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [128]:
spn

rohit       s
virat      ns
risav       s
shreyas    ns
sikhar      s
dtype: object

In [129]:
df.ndim

2

In [130]:
df.shape # (5, 4) 5 rows, 4 cols

(5, 4)

In [131]:
arr=df.values # entire data frame is converted into numpy array

In [132]:
arr.ndim

2

In [133]:
df.index.values

array(['rohit', 'virat', 'risav', 'shreyas', 'sikhar'], dtype=object)

In [134]:
df.columns.values # this is useful

array(['math', 'physics', 'chemistry', 'sponsored'], dtype=object)

In [135]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    80.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

## indexing with dataframe

In [136]:
df['math'] # a columns (series)

rohit      90.0
virat      80.0
risav       NaN
shreyas    60.0
sikhar      NaN
Name: math, dtype: float64

In [137]:
df[['math', 'physics']] # selecting multiple columns

         math  physics
rohit    90.0     70.0
virat    80.0      NaN
risav     NaN     88.0
shreyas  60.0     60.0
sikhar    NaN      NaN

In [138]:
df['math'][1]

80.0

In [139]:
df['math']['virat']

80.0

In [140]:
df.loc['virat','math'] # df['math','virat'] == NOT WORK

80.0

In [141]:
df.info() # desc emp(sql)

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, rohit to sikhar
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   math       3 non-null      float64
 1   physics    3 non-null      float64
 2   chemistry  3 non-null      float64
 3   sponsored  5 non-null      object
dtypes: float64(3), object(1)
memory usage: 256.0+ bytes

In [142]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    80.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [143]:
df.iloc[1, 0]

80.0

In [144]:
df.iloc[1, 0]=85

In [145]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [146]:
df[1:4] # to get sequence of ROWS only [not available for columns]

         math  physics  chemistry sponsored
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns

In [147]:
df[-3:]

         math  physics  chemistry sponsored
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [148]:
df[:3]

       math  physics  chemistry sponsored
rohit  90.0     70.0        NaN         s
virat  85.0      NaN       80.0        ns
risav   NaN     88.0        NaN         s

In [149]:
df.tail() # last 5 rows

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [150]:
df.tail(2) # df[-2:]

         math  physics  chemistry sponsored
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [151]:
df.head() # df[:5]

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [152]:
df[[True,False,True,False,True]]

        math  physics  chemistry sponsored
rohit   90.0     70.0        NaN         s
risav    NaN     88.0        NaN         s
sikhar   NaN      NaN       80.0         s

In [153]:
df['math']>85

rohit       True
virat      False
risav      False
shreyas    False
sikhar     False
Name: math, dtype: bool

In [154]:
df[ df['math'] > 85 ]

       math  physics  chemistry sponsored
rohit  90.0     70.0        NaN         s

In [155]:
df.sum()

math             235
physics          218
chemistry        220
sponsored    snssnss
dtype: object

In [156]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [157]:
df.sum(axis=1)

rohit      160.0
virat      165.0
risav       88.0
shreyas    180.0
sikhar      80.0
dtype: float64

In [158]:
85+np.NaN+80

nan

In [159]:
85+56+90+50+np.NaN

nan

In [160]:
df.mean(axis=1)

rohit      80.0
virat      82.5
risav      88.0
shreyas    60.0
sikhar     80.0
dtype: float64

In [161]:
df.mean()

math         78.333333
physics      72.666667
chemistry    73.333333
dtype: float64

## Deal with missing values

In [162]:
df.isna() # boolean dataFrame

          math  physics  chemistry  sponsored
rohit    False    False       True      False
virat    False     True      False      False
risav     True    False       True      False
shreyas  False    False      False      False
sikhar    True     True      False      False

In [163]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [164]:
df.isna().sum()

math         2
physics      2
chemistry    2
sponsored    0
dtype: int64

In [165]:
df.isna().sum()/df.shape[0]

math         0.4
physics      0.4
chemistry    0.4
sponsored    0.0
dtype: float64

In [166]:
df[df['physics'].isna()]

        math  physics  chemistry sponsored
virat   85.0      NaN       80.0        ns
sikhar   NaN      NaN       80.0         s

In [167]:
~df['physics'].isna()

rohit       True
virat      False
risav       True
shreyas     True
sikhar     False
Name: physics, dtype: bool

In [168]:
df1=df[~df['physics'].isna()]

In [169]:
df1

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns

In [170]:
df.dropna() # drops any row containing missing value

         math  physics  chemistry sponsored
shreyas  60.0     60.0       60.0        ns

In [171]:
df

         math  physics  chemistry sponsored
rohit    90.0     70.0        NaN         s
virat    85.0      NaN       80.0        ns
risav     NaN     88.0        NaN         s
shreyas  60.0     60.0       60.0        ns
sikhar    NaN      NaN       80.0         s

In [172]:
df.fillna(value=0)

         math  physics  chemistry sponsored
rohit    90.0     70.0        0.0         s
virat    85.0      0.0       80.0        ns
risav     0.0     88.0        0.0         s
shreyas  60.0     60.0       60.0        ns
sikhar    0.0      0.0       80.0         s

In [178]:
df=pd.read_csv('data/StudentsPerformance.csv')

In [179]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [180]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 43.0+ KB

In [181]:
sdf=pd.read_csv('data/performance.csv')

In [182]:
sdf

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [183]:
sdf[:5]

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [185]:
sdf.shape

(1000, 8)

In [186]:
ldf=pd.read_csv('data/loan_LC.csv')

c:\users\hp\appdata\local\programs\python\python38-32\lib\site-packages\IPython\core\interactiveshell.py:3145: DtypeWarning: Columns (47) have mixed types.Specify dtype option on import or set low_memory=False.
  has_raised = await self.run_ast_nodes(code_ast.body, cell_name,

In [187]:
ldf.shape

(39717, 111)

In [188]:
ldf[:5]

,id,member_id,loan_amnt,funded_amnt,funded_amnt_inv,term,int_rate,installment,grade,sub_grade,...,num_tl_90g_dpd_24m,num_tl_op_past_12m,pct_tl_nvr_dlq,percent_bc_gt_75,pub_rec_bankruptcies,tax_liens,tot_hi_cred_lim,total_bal_ex_mort,total_bc_limit,total_il_high_credit_limit
0,1077501,1296599,5000,5000,4975.0,36 months,10.65%,162.87,B,B2,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
1,1077430,1314167,2500,2500,2500.0,60 months,15.27%,59.83,C,C4,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
2,1077175,1313524,2400,2400,2400.0,36 months,15.96%,84.33,C,C5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
3,1076863,1277178,10000,10000,10000.0,36 months,13.49%,339.31,C,C1,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN
4,1075358,1311748,3000,3000,3000.0,60 months,12.69%,67.79,B,B5,...,NaN,NaN,NaN,NaN,0.0,0.0,NaN,NaN,NaN,NaN

In [189]:
sdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 43.0+ KB

In [190]:
sdf['gender'].unique()

array(['female', 'male'], dtype=object)

In [191]:
sdf['gender'].value_counts()

female    518
male      482
Name: gender, dtype: int64

In [192]:
sdf['parental level of education'].value_counts()

some college          226
associate's degree    222
high school           196
some high school      179
bachelor's degree     118
master's degree        59
Name: parental level of education, dtype: int64

In [193]:
sdf.columns.values # display all column names

array(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'], dtype=object)

In [194]:
newcols=['gender','race','pedu','lunch','test','math','read','write']
# new column names are stores in a python list

In [195]:
sdf.columns=newcols # renaming columns of a dataframe

In [196]:
sdf[:5]

,gender,race,pedu,lunch,test,math,read,write
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [197]:
sdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   gender  1000 non-null   object
 1   race    1000 non-null   object
 2   pedu    1000 non-null   object
 3   lunch   1000 non-null   object
 4   test    1000 non-null   object
 5   math    1000 non-null   int64
 6   read    1000 non-null   int64
 7   write   1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 43.0+ KB

In [198]:
ldf.shape

(39717, 111)

In [199]:
ldf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 39717 entries, 0 to 39716
Columns: 111 entries, id to total_il_high_credit_limit
dtypes: float64(74), int64(13), object(24)
memory usage: 30.0+ MB

In [200]:
# for loop retrieves all colmns names of dataframe
for v in sdf:
    print(v,sdf[v].dtype)

gender object
race object
pedu object
lunch object
test object
math int64
read int64
write int64

In [201]:
sdf['gender'].dtype

dtype('O')

In [202]:
for v in ldf:
    print(v,ldf[v].dtype)

id int64
member_id int64
loan_amnt int64
funded_amnt int64
funded_amnt_inv float64
term object
int_rate object
installment float64
grade object
sub_grade object
emp_title object
emp_length object
home_ownership object
annual_inc float64
verification_status object
issue_d object
loan_status object
pymnt_plan object
url object
desc object
purpose object
title object
zip_code object
addr_state object
dti float64
delinq_2yrs int64
earliest_cr_line object
inq_last_6mths int64
mths_since_last_delinq float64
mths_since_last_record float64
open_acc int64
pub_rec int64
revol_bal int64
revol_util object
total_acc int64
initial_list_status object
out_prncp float64
out_prncp_inv float64
total_pymnt float64
total_pymnt_inv float64
total_rec_prncp float64
total_rec_int float64
total_rec_late_fee float64
recoveries float64
collection_recovery_fee float64
last_pymnt_d object
last_pymnt_amnt float64
next_pymnt_d object
last_credit_pull_d object
collections_12_mths_ex_med float64
mths_since_last_major_derog float64
policy_code int64
application_type object
annual_inc_joint float64
dti_joint float64
verification_status_joint float64
acc_now_delinq int64
tot_coll_amt float64
tot_cur_bal float64
open_acc_6m float64
open_il_6m float64
open_il_12m float64
open_il_24m float64
mths_since_rcnt_il float64
total_bal_il float64
il_util float64
open_rv_12m float64
open_rv_24m float64
max_bal_bc float64
all_util float64
total_rev_hi_lim float64
inq_fi float64
total_cu_tl float64
inq_last_12m float64
acc_open_past_24mths float64
avg_cur_bal float64
bc_open_to_buy float64
bc_util float64
chargeoff_within_12_mths float64
delinq_amnt int64
mo_sin_old_il_acct float64
mo_sin_old_rev_tl_op float64
mo_sin_rcnt_rev_tl_op float64
mo_sin_rcnt_tl float64
mort_acc float64
mths_since_recent_bc float64
mths_since_recent_bc_dlq float64
mths_since_recent_inq float64
mths_since_recent_revol_delinq float64
num_accts_ever_120_pd float64
num_actv_bc_tl float64
num_actv_rev_tl float64
num_bc_sats float64
num_bc_tl float64
num_il_tl float64
num_op_rev_tl float64
num_rev_accts float64
num_rev_tl_bal_gt_0 float64
num_sats float64
num_tl_120dpd_2m float64
num_tl_30dpd float64
num_tl_90g_dpd_24m float64
num_tl_op_past_12m float64
pct_tl_nvr_dlq float64
percent_bc_gt_75 float64
pub_rec_bankruptcies float64
tax_liens float64
tot_hi_cred_lim float64
total_bal_ex_mort float64
total_bc_limit float64
total_il_high_credit_limit float64

In [203]:
sdf['gender'].value_counts()/sdf.shape[0]

female    0.518
male      0.482
Name: gender, dtype: float64

## checking presence of missing values

In [204]:
sdf.isna().sum()/sdf.shape[0]

gender    0.0
race      0.0
pedu      0.0
lunch     0.0
test      0.0
math      0.0
read      0.0
write     0.0
dtype: float64

## dataframe does not have any missing values

In [205]:
tdf=pd.read_csv("data/titanic.csv")

In [206]:
tdf.shape

(1313, 11)

In [207]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   row.names  1313 non-null   int64
 1   pclass     1313 non-null   object
 2   survived   1313 non-null   int64
 3   name       1313 non-null   object
 4   age        633 non-null    float64
 5   embarked   821 non-null    object
 6   home.dest  754 non-null    object
 7   room       77 non-null     object
 8   ticket     69 non-null     object
 9   boat       347 non-null    object
 10  sex        1313 non-null   object
dtypes: float64(1), int64(2), object(8)
memory usage: 71.9+ KB

In [209]:
tdf[:5]

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
2,3,1st,0,"Allison, Mr Hudson Joshua Creighton",30.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,(135),male
3,4,1st,0,"Allison, Mrs Hudson J.C. (Bessie Waldo Daniels)",25.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male

In [210]:
tdf.isna().sum()/tdf.shape[0]

row.names    0.000000
pclass       0.000000
survived     0.000000
name         0.000000
age          0.517898
embarked     0.374714
home.dest    0.425743
room         0.941356
ticket       0.947449
boat         0.735720
sex          0.000000
dtype: float64

In [211]:
tdf1=tdf.dropna()

In [212]:
tdf1.isna().sum()

row.names    0
pclass       0
survived     0
name         0
age          0
embarked     0
home.dest    0
room         0
ticket       0
boat         0
sex          0
dtype: int64

In [213]:
tdf1.shape[0]

20

In [214]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [215]:
tdf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 11 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   row.names  1313 non-null   int64
 1   pclass     1313 non-null   object
 2   survived   1313 non-null   int64
 3   name       1313 non-null   object
 4   age        633 non-null    float64
 5   embarked   821 non-null    object
 6   home.dest  754 non-null    object
 7   room       77 non-null     object
 8   ticket     69 non-null     object
 9   boat       347 non-null    object
 10  sex        1313 non-null   object
dtypes: float64(1), int64(2), object(8)
memory usage: 71.9+ KB

In [216]:
tdf1=tdf.drop( [2,3]  )  # drop records

In [217]:
tdf1[:5]

,row.names,pclass,survived,name,age,embarked,home.dest,room,ticket,boat,sex
0,1,1st,1,"Allen, Miss Elisabeth Walton",29.0000,Southampton,"St Louis, MO",B-5,24160 L221,2,female
1,2,1st,0,"Allison, Miss Helen Loraine",2.0000,Southampton,"Montreal, PQ / Chesterville, ON",C26,NaN,NaN,female
4,5,1st,1,"Allison, Master Hudson Trevor",0.9167,Southampton,"Montreal, PQ / Chesterville, ON",C22,NaN,11,male
5,6,1st,1,"Anderson, Mr Harry",47.0000,Southampton,"New York, NY",E-12,NaN,3,male
6,7,1st,1,"Andrews, Miss Kornelia Theodosia",63.0000,Southampton,"Hudson, NY",D-7,13502 L77,10,female

In [218]:
tdf1=tdf.drop( ["room","ticket"] ,axis=1 )  # drop column

In [219]:
tdf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 9 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   row.names  1313 non-null   int64
 1   pclass     1313 non-null   object
 2   survived   1313 non-null   int64
 3   name       1313 non-null   object
 4   age        633 non-null    float64
 5   embarked   821 non-null    object
 6   home.dest  754 non-null    object
 7   boat       347 non-null    object
 8   sex        1313 non-null   object
dtypes: float64(1), int64(2), object(6)
memory usage: 61.6+ KB

In [220]:
tdf1=tdf1.drop('boat',axis=1) # drop column

In [221]:
tdf1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1313 entries, 0 to 1312
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   row.names  1313 non-null   int64
 1   pclass     1313 non-null   object
 2   survived   1313 non-null   int64
 3   name       1313 non-null   object
 4   age        633 non-null    float64
 5   embarked   821 non-null    object
 6   home.dest  754 non-null    object
 7   sex        1313 non-null   object
dtypes: float64(1), int64(2), object(5)
memory usage: 56.5+ KB

In [222]:
tdf1.shape

(1313, 8)

In [223]:
tdf1=tdf1.dropna()

In [224]:
tdf1.shape

(594, 8)

In [225]:
sdf.isna().sum()

gender    0
race      0
pedu      0
lunch     0
test      0
math      0
read      0
write     0
dtype: int64

In [226]:
sdf[:5]

,gender,race,pedu,lunch,test,math,read,write
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [227]:
sdf['test'].unique()

array(['none', 'completed'], dtype=object)

## replace 'none'==0 and 'completed'==1

In [228]:
sdf['test']=sdf['test'].replace( {'none':0,'completed':1 }     )

In [229]:
sdf[:5]

   gender     race                pedu         lunch  test  math  read  write
0  female  group B   bachelor's degree      standard     0    72    72     74
1  female  group C        some college      standard     1    69    90     88
2  female  group B     master's degree      standard     0    90    95     93
3    male  group A  associate's degree  free/reduced     0    47    57     44
4    male  group C        some college      standard     0    76    78     75

In [230]:
sdf['lunch'].unique()

array(['standard', 'free/reduced'], dtype=object)

In [231]:
sdf['lunch']=sdf['lunch'].replace({'standard':10,'free/reduced':20})

In [232]:
sdf[:5]

   gender     race                pedu  lunch  test  math  read  write
0  female  group B   bachelor's degree     10     0    72    72     74
1  female  group C        some college     10     1    69    90     88
2  female  group B     master's degree     10     0    90    95     93
3    male  group A  associate's degree     20     0    47    57     44
4    male  group C        some college     10     0    76    78     75

In [233]:
list( sdf['pedu'].unique())

["bachelor's degree",
 'some college',
 "master's degree",
 "associate's degree",
 'high school',
 'some high school']

In [234]:
for idx,nm in enumerate( list( sdf['pedu'].unique( ) ) ,1):
    print(idx,'---',nm)

1 --- bachelor's degree
2 --- some college
3 --- master's degree
4 --- associate's degree
5 --- high school
6 --- some high school

In [235]:
# dictionary comprehension
d={ name:idx for idx,name in enumerate( list( sdf['pedu'].unique( ) ) ,1) }

In [236]:
sdf['pedu']=sdf['pedu'].replace( d )

In [237]:
sdf[:5]

   gender     race  pedu  lunch  test  math  read  write
0  female  group B     1     10     0    72    72     74
1  female  group C     2     10     1    69    90     88
2  female  group B     3     10     0    90    95     93
3    male  group A     4     20     0    47    57     44
4    male  group C     2     10     0    76    78     75

In [238]:
sdf['math'].mean()

66.089

In [239]:
sdff=sdf[ sdf['gender']=='female']

In [240]:
sdff.shape

(518, 8)

In [241]:
sdff['math'].mean()

63.633204633204635

In [242]:
sdf[ sdf['gender']=='female']['math'].mean() # 63.63  overall 66.08

63.633204633204635

In [243]:
sdf[ sdf['gender']=='male']['math'].mean() # 68.72 overall 66.08

68.72821576763485

In [244]:
sdf[sdf['test']==1]['math'].mean()  # 69.69 (70)

69.69553072625699

In [245]:
sdf[sdf['test']==0]['math'].mean() # 64.07

64.0778816199377

In [246]:
sdf[(sdf['test']==1) & (sdf['gender']=='female')]["math"].mean() # (67)

67.19565217391305

In [247]:
sdf[(sdf['test']==0) & (sdf['gender']=='female')]["math"].mean() #61.67 (62)

61.67065868263473

In [248]:
sdf[(sdf['test']==1) & (sdf['gender']=='male')]["math"].mean() #72

72.33908045977012

In [249]:
sdf[(sdf['test']==0) & (sdf['gender']=='male')]["math"].mean()

66.68831168831169

In [250]:
sdf[:5]

   gender     race  pedu  lunch  test  math  read  write
0  female  group B     1     10     0    72    72     74
1  female  group C     2     10     1    69    90     88
2  female  group B     3     10     0    90    95     93
3    male  group A     4     20     0    47    57     44
4    male  group C     2     10     0    76    78     75

In [251]:
sdf=pd.read_csv("data/performance.csv")

In [252]:
newcols=['gender','race','pedu','lunch','test','math','read','write']

In [253]:
sdf.columns=newcols

In [254]:
sdf[:5]

,gender,race,pedu,lunch,test,math,read,write
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [255]:
sdf['total']=sdf['math']+sdf['read']+sdf['write']

In [256]:
sdf[:5]

,gender,race,pedu,lunch,test,math,read,write,total
0,female,group B,bachelor's degree,standard,none,72,72,74,218
1,female,group C,some college,standard,completed,69,90,88,247
2,female,group B,master's degree,standard,none,90,95,93,278
3,male,group A,associate's degree,free/reduced,none,47,57,44,148
4,male,group C,some college,standard,none,76,78,75,229

In [257]:
d={ name:idx for idx,name in enumerate( list( sdf['pedu'].unique( ) ) ,1) }

In [258]:
sdf['pedu1']=sdf['pedu'].replace(d)

In [259]:
sdf[:5]

,gender,race,pedu,lunch,test,math,read,write,total,pedu1
0,female,group B,bachelor's degree,standard,none,72,72,74,218,1
1,female,group C,some college,standard,completed,69,90,88,247,2
2,female,group B,master's degree,standard,none,90,95,93,278,3
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,4
4,male,group C,some college,standard,none,76,78,75,229,2

In [260]:
d

{"bachelor's degree": 1,
 'some college': 2,
 "master's degree": 3,
 "associate's degree": 4,
 'high school': 5,
 'some high school': 6}

In [261]:
sdf[sdf['pedu1']==3]['math'].mean()

69.7457627118644

In [262]:
sdf[sdf['pedu1']==6]['math'].mean()

63.497206703910614

## univariate analysis
- analysing a single continous column
- segmented univariate analysis

In [263]:
sdf.pivot_table(values='math',index="pedu")

                         math
pedu
associate's degree  67.882883
bachelor's degree   69.389831
high school         62.137755
master's degree     69.745763
some college        67.128319
some high school    63.497207

In [264]:
sortdf=sdf.pivot_table(values='math',index='race')

In [265]:
sortdf=ser.sort_values(by="math",ascending=False)

TypeError: sort_values() got an unexpected keyword argument 'by'

In [266]:
sortdf

              math
race
group A  61.629213
group B  63.452632
group C  64.463950
group D  67.362595
group E  73.821429

In [271]:
pidf=sdf.pivot_table(values='math',index='pedu',columns='gender')

In [272]:
pidf.columns

Index(['female', 'male'], dtype='object', name='gender')

In [273]:
pidf.sort_values(by='male',ascending=False)

gender                 female       male
pedu
master's degree     66.500000  74.826087
associate's degree  65.250000  70.764151
bachelor's degree   68.349206  70.581818
some college        65.406780  69.009259
some high school    59.296703  67.840909
high school         59.351064  64.705882

In [274]:
pidf.sort_values(by='female',ascending=False)

gender                 female       male
pedu
bachelor's degree   68.349206  70.581818
master's degree     66.500000  74.826087
some college        65.406780  69.009259
associate's degree  65.250000  70.764151
high school         59.351064  64.705882
some high school    59.296703  67.840909

## From the above comparison , it is evident that male child master degree holderare doing well but female childs of same group unable to good in math. Most probably female childs of the said group requires more motivation

In [275]:
sdf.pivot_table(values='math',index=['pedu','test'],columns='gender')

gender                           female       male
pedu               test
associate's degree completed  70.047619  73.700000
                   none       62.527027  68.984848
bachelor's degree  completed  71.000000  75.375000
                   none       66.926829  66.870968
high school        completed  61.896552  68.333333
                   none       58.215385  63.400000
master's degree    completed  69.857143  72.333333
                   none       64.363636  75.705882
some college       completed  67.928571  75.685714
                   none       64.013158  65.808219
some high school   completed  63.828571  69.095238
                   none       56.464286  66.695652

In [276]:
sdf[(sdf['pedu']=="master's degree") & (sdf['test']=='completed') & (sdf['gender']=='male')]

,gender,race,pedu,lunch,test,math,read,write,total,pedu1
18,male,group C,master's degree,free/reduced,completed,46,42,46,134,3
180,male,group C,master's degree,free/reduced,completed,62,68,75,205,3
604,male,group D,master's degree,free/reduced,completed,84,89,90,263,3
752,male,group C,master's degree,free/reduced,completed,79,77,75,231,3
846,male,group C,master's degree,standard,completed,91,85,85,261,3
940,male,group C,master's degree,free/reduced,completed,72,66,72,210,3

In [277]:
pd.crosstab(index=[sdf['pedu'],sdf['gender']],columns=sdf['test'])

test                       completed  none
pedu               gender
associate's degree female         42    74
                   male           40    66
bachelor's degree  female         22    41
                   male           24    31
high school        female         29    65
                   male           27    75
master's degree    female         14    22
                   male            6    17
some college       female         42    76
                   male           35    73
some high school   female         35    56
                   male           42    46

In [278]:
pd.crosstab(index=sdf['pedu'],columns=sdf['test'],margins=True)

test                completed  none   All
pedu
associate's degree         82   140   222
bachelor's degree          46    72   118
high school                56   140   196
master's degree            20    39    59
some college               77   149   226
some high school           77   102   179
All                       358   642  1000

In [279]:
pd.crosstab(index=sdf['pedu'],columns=sdf['test'])

test                completed  none
pedu
associate's degree         82   140
bachelor's degree          46    72
high school                56   140
master's degree            20    39
some college               77   149
some high school           77   102

In [280]:
pd.crosstab(index=sdf['pedu'],columns=sdf['test'],normalize='index') # calculates percentage row wise

test                completed      none
pedu
associate's degree   0.369369  0.630631
bachelor's degree    0.389831  0.610169
high school          0.285714  0.714286
master's degree      0.338983  0.661017
some college         0.340708  0.659292
some high school     0.430168  0.569832